# გაასწორე შეცოდმები და კომენტარის სახით მიუწერე რა არის შეცდომა:
# # 1
# num1 = ;one;
# print(num1)
# # 2
# num2 = ('two')
# # 3
# Num3 = 'three'
# print(num3)
# # 4
# um4 = 'nnumber4"
# print(num4)
# # 5
# 5num = 'five'
# print(5num)
num1 = ;one;
# წერტილმძიმეს ნაცვლად უნდა ეწეროს ფრჩხილები
print(num1)
# ფრჩხილები არ სჭირდება
num2 = ('two')
2-ს ბრჭყალებიარ შჭირდება
Num3 = 'three'
# 3-ს არ სჭირდება ბრჭყალები მაგრამ სწირდებაფრჩხილები
um4 = 'nnumber4"
 ცვლადის მნიშვნელობას აკლიაერთი ბრჭყალები
 5num = 'five'
#  numis წინ არ შეიძლება 5-ის დაწერა

