goa_grpups = "group 62",62,62.0

# string integer float boolean string: "hello nia",integer: 15, 19 9 10...,float:62.0,boolean:True and False
# print(True or False) "True"
#  print(True and False) "False"
#  print(False or False) "False"
# print(True and True) "True"

# name = "nia"
# print(type(name))

# name = str(input("Enter your name:"))
# print(type(name))

# for i in range(1,10):
#     print(i)

# numbers = 0
# while numbers <= 10:
#     print("hello world")
#     numbers+=1

# name = "barbare"

# print(f"{name}")
# i = 0
# if i<=10:
#     print("hello nia")
# elif i>=10:
#     print("hello barbare")
"-----------------------------------------------------------------------------"
# 1.კომენტარის სახით ახსენით და ჩამოთვალეთ რა არის data type-ს და რას ნიშნავს.
# string: "hello nia" str არის ""-ში  ჩაწერილი ნებისმიერი ტექსტი ან რიცხვი
# integer:10 20 30 40 50 60 70 80 90 100 int არის მთელი რიცხვები
# float:62.0 float არის ათწილადი
# boolean:True or False? True True and False?False bool არის ჭეშმარიტი და მცდარი
"------------------------------------------------------------------------------"
# 2.რისთვის ვიყენებთ type ატრიბუტს?
# type ატრიბუტს ვიყენებთ იმისავის რომ გავიგოტ ცვლადში არსებული data type-ის ვინაობა
"------------------------------------------------------------------------------"
# 3.მოიყვანეთ მაგალითი რა არის and/or ოპერატორები
# True or False? True True and False?False bool არის ჭეშმარიტი და მცდარი
"------------------------------------------------------------------------------"
# goa_grpups = "group 62",62,62.0 ცვლადი არ8ს იგივე ყუთი სადაც ინახება ეს data type-ები
"------------------------------------------------------------------------------"
# 5.რა არის კონკატინაცია?
# სტრინგს ემატება სტრინგი 
"-----------------------------------------------------------------------------"
# 6.რა არის input და output?
# მაგალითად ავიღოთ ღილაკი ამ ღილაკს რომ მივაწვებით ჩვენ ამით გავუშვით input დაoutput-ად გამოვიდა შუქი
# name = str(input("Enter your name:"))
# print(type(name))
"------------------------------------------------------------------------------"
# 7.მომხმარებელს შემოატანინეთ თავისი სახელი და იმდენჯერ დაუბეჭდეთ რამდენჯერაც მას უნდა.
# name = str(input("Enter your name:"))
# num = int(input("Enter your num:"))
# print(name*num)
"------------------------------------------------------------------------------"
# 8. რა არის snake case?
# snake case იწერება ასე goa_grups 
"---------------------------------------------------------------------------"
# 9. გამოთვალეთ მართკუთხედის პერიმეტრი თუ სიმაღლე არის 11სმ,ხოლო სიგანე 
# 16სმ.
# height = 11
# width = 16
# print((height+width)*2)
"------------------------------------------------------------------------------"
# 10.გაასწორეთ კოდი
Name = 'nia'
print(Name)
"----------------------------------"
#a = 17
#b = str(nia)
#print(a * b)
"--------------------------------------------------------------"
#n = input("enter ur name:" )
#k = int(input("enter your num:" ))
"------------------------------------------------------------------------------"
# 11.რა არის f string?(შექმენით რაიმე ლამაზი წინადადება მისი გამოყენებით)

# name = "barbare"
# usurname = "tsivilashvili"
# age = 9
# favorite_color = "pink"
# second_favorite_color = "gold"
# print(f"{name} {usurname} {age} {favorite_color} {second_favorite_color}")
"------------------------------------------------------------------------------"
# 12. რა არის if elif else?(შეამოწმეთ მომხმარებლის ასაკი,თუ არის 18 წელზე ნაკლები,დაპრინტე რომ არის ბავში, თუ არის 18 წლის წემოთ,მაშინ დაპრინტე სრულწლოვანი და საბოლოოდ თუ არის 30+,დაპრინტე 'too old')
# i = 0
# if i<18:
#     print("you are a child")
# elif i>18:
#     print("you are an adult")
# else:
#  print("too old")
"---------------------------------------------------------------------------"
# 13.def ფუნქციის დახმარებით შეამოწმე რიცხვი,კენტია თუ ლუწი.

"-----------------------------------------------------------------------"
# 1.რა არის html,css,js
# პორგრამირების ენები
"---------------------------------------------------------------------------"
# 2.თქვენი აზრით რა არის heading?p?img?strong?b?i?u?
# <h1>-დან <h6>- ესენი არის მაგალითად ჰ1 ყველაზე დიდ ასოებს წერს ჰ2 საშვალო ჰ3 უფრო საშვალო და ა.შ,img არის იმეიჯი ანუ რამე ფოტოს რომ შემოიტან საიტზე,strong
#  
# ბ ბრეიქი ანუ ხაზს ტეხავს,ი ,უ არის ქვემოდან ხაზი რომ გაესმევა
"--------------------------------------------------------------------------"
# 3.როგორი სიები არსებობს? html-ში?(წარმოადგინეთ მათი სტრუქტურა)
# ul
# li
"---------------------------------------------------------------------------"
# 4.რა არის block level და inline elements
# block level p,h1-h6,b.
# inline elements img,strong,u.
"--------------------------------------------------------------------------"
# 5.ააგეთ საიტი როგორიც თქვენ გსურთ,ოღონდ გამოიყენეთ ყველა ის მასალა რომელიც თქვენ იცით(გამოიყენეთ css)
