# 3)შექმენი სია 15 ცალი ელემენტით, პირველი 5 იყოს სტრინგი და ეწეროს სააქართველოს ქალაქები, მეორე 5ეული იყოს რიცხვები და ეწეროს თქვენი ოჯახის წევრების ასაკები(ან ნათესავების), მესამე 5ეული იყოს boolean ები(True False), შემდეგ შექმენით სამი ცვლადი სადაც იქნება input და მომხარებელს შემოატანინეთ რაიმე მნიშვნელობა, შემდგომ სიაში მე 4 ელემენტი მე 7 ელემენტი და მე 11 ელემენტი შეცვალეთ ამ სამი input ით
foods = ["თბილისი,გორი","ქუთაისი","barbare","ზესტაფონი",10,"nia","38","9","4","aleqsandre","FALSE","TRUE","FALSE"]
user0 = int(input("enter your name"))
user1 = int(input("enter your name"))
user2 = int(input("enter your name"))
foods [4] = user0
foods [7] = user1
foods [11] = user2
print(foods)