// 4)ახსენით როგორ მუშაობს map & filter & reduce
// map - გამოიყენება სიის თითოეულ ელემენტზე ფუნქციის გამოყენებისთვის და ახალი სიის შექმნისთვის, რომელიც შეიცავს ფუნქციის შედეგებს.
// filter - გამოიყენება სიის ელემენტების ფილტრაციისთვის, რათა მიიღოთ ახალი სია, რომელიც შეიცავს მხოლოდ იმ ელემენტებს, რომლებიც აკმაყოფილებენ გარკვეულ პირობას.
// reduce - გამოიყენება სიის ელემენტების კომბინირებისთვის ერთ მნიშვნელობად, მაგალითად ჯამისთვის ან პროდუქტისთვის. ის იღებს ფუნქციას და საწყის მნიშვნელობას, და ფუნქცია იძახება თითოეულ ელემენტზე, სადაც აკუმულატორი (acc) ინახავს მიმდინარე შედეგს.