// Stack და Heap არის მეხსიერების (memory) ორი განსხვავებული ნაწილი, რომლებიც გამოიყენება პროგრამების მუშაობის დროს. ისინი განსაკუთრებით მნიშვნელოვანია ისეთ ენებში, როგორიცაა C, C++, Java, Python და სხვა.\


// Stack არის მეხსიერების ნაწილი, სადაც ინახება ლოკალური ცვლადები და ფუნქციების გამოძახებები.





// Heap არის მეხსიერების ნაწილი, რომელიც გამოიყენება დინამიკური მეხსიერების გამოყოფისთვის.





"-------------------------------------------------------------------------------------------"
// პროგრამირებაში მონაცემთა ტიპები იყოფა პრიმიტიულ (Primitive) და კომპლექსურ (Complex / Reference) ტიპებად. ისინი განსაზღვრავენ რა ტიპის მონაცემს ინახავს ცვლადი და რამდენ მეხსიერებას იყენებს.


// პრიმიტიული ტიპები არის მარტივი, ძირითადი მონაცემები, რომლებიც ინახავენ მხოლოდ ერთ მნიშვნელობას.


// კომპლექსური ტიპები შედგება რამდენიმე მნიშვნელობისგან ან სტრუქტურისგან.



"----------------------------------------------------------------------------------------------"
// მოდულარულობა (Modularity) არის პროგრამირების პრინციპი, რომლის მიხედვითაც დიდი პროგრამა იყოფა პატარა დამოუკიდებელ ნაწილებად (მოდულებად). თითოეულ მოდულს აქვს კონკრეტული ფუნქცია ან ამოცანა.





"----------------------------------------------------------------------------------------------"
// Hoisting არის მექანიზმი JavaScript-ში, რომლის დროსაც ცვლადების და ფუნქციების დეკლარაციები თითქოს კოდის ზედა ნაწილში “აიწევა”, სანამ პროგრამა შესრულდება. ანუ JavaScript კოდი ჯერ ამზადებს ცვლადებს და ფუნქციებს (შექმნის ფაზა) და შემდეგ იწყებს კოდის შესრულებას.

// ცვლადებთან hoisting ასე მუშაობს:
// თუ ცვლადი გამოცხადებულია var-ით, მისი დეკლარაცია აიწევა კოდის ზედა ნაწილში და თავდაპირველად მას ენიჭება მნიშვნელობა undefined. მაგალითად:

// console.log(a); // undefined
// var a = 5;

// JavaScript ამას რეალურად ასე აღიქვამს:

// var a;
// console.log(a); // undefined
// a = 5;

// ანუ დეკლარაცია აიწია, მაგრამ მნიშვნელობის მინიჭება დარჩა თავის ადგილას.
// var → hoist ხდება და დეკლარაციამდე მნიშვნელობა არის undefined.

// let და const → hoist ხდება, მაგრამ დეკლარაციამდე წვდომა იწვევს ReferenceError-ს (Temporal Dead Zone).




// JavaScript იყენებს V8 ძრავას
// react არის JavaScript ბიბლიოთეკა, რომელიც გამოიყენება ვებ ინტერფეისების (UI) შესაქმნელად.
  