// Promise JavaScript-ში არის ობიექტი, რომელიც წარმოადგენს მომავალში შესრულებულ ან შეუსრულებელ დაპირებას. ანუ, როცა კოდი რაღაც შედეგს ვერ აბრუნებს მაშინვე, Promise გვეუბნევა, რომ მოგვიანებით მოგვცემს პასუხს — ან სწორს, ან არასწორს.




// resolve გამოიყენება მაშინ, როცა პირობა წარმატებით სრულდება.ესეიგი ყველაფერი სწორად წავიდა 
// reject გამოიყენება მაშინ, როცა ოპერაცია შეცდომით სრულდება.რაღაც სწორად ვერ  გავაკეთე



// pending  არის საწყისი მდგომარეობა, როცა Promise ჯერ კიდევ გრძელდება. შედეგი არც მიღებულია და არც შეცდომაა.ანუ პროცესი ჯერ არ დასრულებულა.
// fulfilled მდგომარეობა ნიშნავს, რომ Promise წარმატებით შესრულდა.პირობა დასრულდა და მივიღეთ შედეგი.
// rejected მდგომარეობა ნიშნავს, რომ Promise შეცდომით დასრულდა. პირობა ვერ შესრულდა და მივიღეთ შეცდომა.

// PromiseResult არის მნიშვნელობა, რომელიც Promise-ს აქვს დასრულების შემდეგ.

// .then()

// გამოიყენება მაშინ, როცა Promise წარმატებით სრულდება 

// .catch()

// გამოიყენება მაშინ, როცა Promise შეცდომით სრულდება 



// თუ Promise-ში არც resolve და არც reject არ გამოიძახე, მაშინ Promise დარჩება pending მდგომარეობაში და არასდროს დასრულდება.

// ეს ნიშნავს, რომ არც .then() და არც .catch() არ შესრულდება, რადგან Promise-ს არ აქვს საბოლოო შედეგი.