// Object პროგრამირებაში არის ერთეული, რომელსაც აქვს მახასიათებლები (properties) და ქმედებები (methods) და წარმოადგენს კლასის კონკრეტულ მაგალითს; რეალური მაგალითებია: მანქანა (ფერი, მოდელი, მოძრაობა), ტელეფონი (ბრენდი, მეხსიერება, დარეკვა) და სტუდენტი (სახელი, ასაკი, სწავლა).
// რეალური მაგალითი:
// მანქანა არის ობიექტი — მას აქვს მახასიათებლები (ფერი, მოდელი, სიჩქარე) და ქმედებები (მოძრაობა, გაჩერება, აჩქარება). 




"-----------------------------------------------------------"
// String = მეთოდები: toUpperCase(), toLowerCase(), slice(); მახასიათებელი: length.

//  Array = მეთოდები: push(), pop(), map(); მახასიათებელი: length.

//  Math = მეთოდები: random(), round(); მახასიათებელი: PI.

//  Date = მეთოდები: getFullYear(), getMonth(), getDate().


"-----------------------------------------------------"
// Callback არის ფუნქცია, რომელიც გადაეცემა სხვა ფუნქციას არგუმენტად და სრულდება შემდეგ, როცა ძირითადი ფუნქცია დაასრულებს მუშაობას.

// მაგ:
// JavaScript-ში setTimeout იყენებს callback ფუნქციას — ფუნქცია შესრულდება გარკვეული დროის შემდეგ.


"----------------------------------------------------------------"
//  Function Declaration
// მაგალითი:
// function greet() { }

// Function Expression
// მაგალითი:
// let greet = function() { }
//  Arrow Function
// მაგალითი:
// let greet = () => { }