# 1)კომენტარების სახით ახსენით რას  აკეთებს map & filter, და რაში გამოიყენება თითოეული
# map არის ფუნქცია რომელიც არის ფორ ლუპის შემოკლებული ვერსია და მას გადაეცემა 2 არგუმენტი პირველი არის ფუნქცია მეორე კი თვითონ სია და ამ სიაში ყველა ელემენტზე ამუშავდება ეს ფუნქცია და ახალ სიაში ჩაემატება ეს შეცვლილი ელემენტები
# filter არის მაპის მსგავსი ფუნქცია რომელიც უკვე კი არ შეცვლის ელემენტებს არამედ  თითოეულ პირობას განიხილიავს და თუ ეს პირობა არის მართალი მაშინ ეს ელემენტი ჩაემატება სიაში და თუ მცდარი არ ჩაემატება სიაში
