// 1) შექმენით ობიეტი მწერზე, მახასიათებლით + მეთოდებით
let eant = {
    eant_name:"cocroche"
    fly: function(){
        console.log("bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz")
    eant.fly()
}
}






"-------------------------------------------------------------------------------------------------------------------"
// 2) შექმენით ობიექტი ფრინველზე, მახასიათებლით + მეთოდებით
let bird = {
    bird_name:"Seagull"
    fly: function(){
        console.log("flatttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt")
    bird.fly()
}
}
"---------------------------------------------------------------------------------------------------------------------------"
// 3) შექმენით ობიეტი smart watch ზე
let phone = {
    brand:"samsung",
    color: "pink",
    year: 2025,
}
"---------------------------------------------------------------------------------------------------------------------------------"
// 4) კომენტარების სახით ახსენით რა არის მეთოდი
// ყველა მეთოდი იწერება "."-ით მაგ:".append()"
"----------------------------------------------------------------------------------------------------------------------------"
// 5) კომენტარენის სახით ახსენით რა არის მახასიათებეlი
// მახასიათებელი არის იგივე თვისებები გამოშვების წელი რა ბრენდისაა და ა.შ